## Credit Card customers dataset - Predict Churning customers
* https://www.kaggle.com/sakshigoyal7/credit-card-customers

* **PLEASE IGNORE THE LAST 2 COLUMNS (NAIVE BAYES CLAS…). I SUGGEST TO RATHER DELETE IT BEFORE DOING ANYTHING**

- CLIENTNUM: Client number. Unique identifier for the customer holding the account
- Attrition_Flag: Internal event (customer activity) variable - if the account is closed then 1 else 0
- Customer_Age: Demographic variable - Customer's Age in Years
- Gender: Demographic variable - M=Male, F=Female
- Dependent_count: Demographic variable - Number of dependents
- Education_Level: Demographic variable - Educational Qualification of the account holder (example: high school, college graduate, etc.)
- Marital_Status: Demographic variable - Married, Single, Divorced, Unknown
- Income_Category: Demographic variable - Annual Income Category of the account holder (< $40K, $40K - 60K, $60K - $80K, $80K-$120K, >
- Card_Category: Product Variable - Type of Card (Blue, Silver, Gold, Platinum)
- Months_on_book: Period of relationship with bank
- Total_Relationship: Total no. of products held by the customer
- Months_Inactive_12: No. of months inactive in the last 12 months
- Contacts_Count_1: No. of Contacts in the last 12 months
- Credit_Limit: Credit Limit on the Credit Card
- Total_Revolving_Bal: Total Revolving Balance on the Credit Card
- Avg_Open_To_Buy: Open to Buy Credit Line (Average of last 12 months)
- Total_Amt_Chng_Q4_Q1: Change in Transaction Amount (Q4 over Q1)
- Total_Trans_Amt: Total Transaction Amount (Last 12 months)
- Total_Trans_Ct: Total Transaction Count (Last 12 months)
- Total_Ct_Chng_Q4_Q1: Change in Transaction Count (Q4 over Q1)
- Avg_Utilization_Ratio: Average Card Utilization Ratio

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
churn_df = pd.read_csv("datasets/BankChurners.csv")
churn_df.head()

,CLIENTNUM,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,...,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio,Naive_Bayes_Classifier_Attrition_Flag_Card_Category_Contacts_Count_12_mon_Dependent_count_Education_Level_Months_Inactive_12_mon_1,Naive_Bayes_Classifier_Attrition_Flag_Card_Category_Contacts_Count_12_mon_Dependent_count_Education_Level_Months_Inactive_12_mon_2
0,768805383,Existing Customer,45,M,3,High School,Married,$60K - $80K,Blue,39,...,12691.0,777,11914.0,1.335,1144,42,1.625,0.061,0.000093,0.99991
1,818770008,Existing Customer,49,F,5,Graduate,Single,Less than $40K,Blue,44,...,8256.0,864,7392.0,1.541,1291,33,3.714,0.105,0.000057,0.99994
2,713982108,Existing Customer,51,M,3,Graduate,Married,$80K - $120K,Blue,36,...,3418.0,0,3418.0,2.594,1887,20,2.333,0.000,0.000021,0.99998
3,769911858,Existing Customer,40,F,4,High School,Unknown,Less than $40K,Blue,34,...,3313.0,2517,796.0,1.405,1171,20,2.333,0.760,0.000134,0.99987
4,709106358,Existing Customer,40,M,3,Uneducated,Married,$60K - $80K,Blue,21,...,4716.0,0,4716.0,2.175,816,28,2.500,0.000,0.000022,0.99998

In [3]:
churn_df.drop(["CLIENTNUM","Naive_Bayes_Classifier_Attrition_Flag_Card_Category_Contacts_Count_12_mon_Dependent_count_Education_Level_Months_Inactive_12_mon_1","Naive_Bayes_Classifier_Attrition_Flag_Card_Category_Contacts_Count_12_mon_Dependent_count_Education_Level_Months_Inactive_12_mon_2"], axis=1, inplace=True)

In [4]:
churn_df.sample(5)

,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio
4356,Existing Customer,48,M,4,High School,Married,$80K - $120K,Blue,36,5,1,2,6798.0,2517,4281.0,0.873,4327,79,0.881,0.370
1667,Existing Customer,48,M,3,Graduate,Unknown,$60K - $80K,Blue,36,3,3,2,6703.0,1252,5451.0,0.625,1843,44,0.630,0.187
6604,Attrited Customer,52,M,2,High School,Married,$60K - $80K,Blue,40,3,4,2,23128.0,1958,21170.0,0.604,2050,35,0.667,0.085
2182,Existing Customer,32,M,3,College,Single,$80K - $120K,Blue,21,4,3,5,21390.0,0,21390.0,0.946,2477,59,0.341,0.000
5038,Existing Customer,42,F,3,Unknown,Unknown,$40K - $60K,Blue,36,3,2,2,3015.0,0,3015.0,0.927,4277,80,0.951,0.000

In [5]:
churn_df.columns

Index(['Attrition_Flag', 'Customer_Age', 'Gender', 'Dependent_count',
       'Education_Level', 'Marital_Status', 'Income_Category', 'Card_Category',
       'Months_on_book', 'Total_Relationship_Count', 'Months_Inactive_12_mon',
       'Contacts_Count_12_mon', 'Credit_Limit', 'Total_Revolving_Bal',
       'Avg_Open_To_Buy', 'Total_Amt_Chng_Q4_Q1', 'Total_Trans_Amt',
       'Total_Trans_Ct', 'Total_Ct_Chng_Q4_Q1', 'Avg_Utilization_Ratio'],
      dtype='object')

In [6]:
churn_df.dtypes

Attrition_Flag               object
Customer_Age                  int64
Gender                       object
Dependent_count               int64
Education_Level              object
Marital_Status               object
Income_Category              object
Card_Category                object
Months_on_book                int64
Total_Relationship_Count      int64
Months_Inactive_12_mon        int64
Contacts_Count_12_mon         int64
Credit_Limit                float64
Total_Revolving_Bal           int64
Avg_Open_To_Buy             float64
Total_Amt_Chng_Q4_Q1        float64
Total_Trans_Amt               int64
Total_Trans_Ct                int64
Total_Ct_Chng_Q4_Q1         float64
Avg_Utilization_Ratio       float64
dtype: object

In [7]:
missing_val_count_by_column = (churn_df.isnull().sum())
print(missing_val_count_by_column[missing_val_count_by_column > 0])

Series([], dtype: int64)

In [8]:
churn_df.isnull().values.any()

False

In [9]:
churn_df.shape

(10127, 20)

In [10]:
churn_df.describe().T

,count,mean,std,min,25%,50%,75%,max
Customer_Age,10127.0,46.325960,8.016814,26.0,41.000,46.000,52.000,73.000
Dependent_count,10127.0,2.346203,1.298908,0.0,1.000,2.000,3.000,5.000
Months_on_book,10127.0,35.928409,7.986416,13.0,31.000,36.000,40.000,56.000
Total_Relationship_Count,10127.0,3.812580,1.554408,1.0,3.000,4.000,5.000,6.000
Months_Inactive_12_mon,10127.0,2.341167,1.010622,0.0,2.000,2.000,3.000,6.000
Contacts_Count_12_mon,10127.0,2.455317,1.106225,0.0,2.000,2.000,3.000,6.000
Credit_Limit,10127.0,8631.953698,9088.776650,1438.3,2555.000,4549.000,11067.500,34516.000
Total_Revolving_Bal,10127.0,1162.814061,814.987335,0.0,359.000,1276.000,1784.000,2517.000
Avg_Open_To_Buy,10127.0,7469.139637,9090.685324,3.0,1324.500,3474.000,9859.000,34516.000
Total_Amt_Chng_Q4_Q1,10127.0,0.759941,0.219207,0.0,0.631,0.736,0.859,3.397
Total_Trans_Amt,10127.0,4404.086304,3397.129254,510.0,2155.500,3899.000,4741.000,18484.000
Total_Trans_Ct,10127.0,64.858695,23.472570,10.0,45.000,67.000,81.000,139.000
Total_Ct_Chng_Q4_Q1,10127.0,0.712222,0.238086,0.0,0.582,0.702,0.818,3.714
Avg_Utilization_Ratio,10127.0,0.274894,0.275691,0.0,0.023,0.176,0.503,0.999

In [11]:
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import OneHotEncoder

In [12]:
churn_df["Attrition_Flag"].unique()

array(['Existing Customer', 'Attrited Customer'], dtype=object)

In [13]:
attrition_flag = [
    "Existing Customer",
    "Attrited Customer"
]

In [14]:
label_encoding_af = LabelEncoder()

label_encoding_af = label_encoding_af.fit(attrition_flag)

In [15]:
churn_df['Attrition_Flag'] = \
    label_encoding_af.transform(churn_df['Attrition_Flag'].astype(str))

In [16]:
label_encoding_af.classes_

array(['Attrited Customer', 'Existing Customer'], dtype='<U17')

In [17]:
churn_df.head()

,Attrition_Flag,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio
0,1,45,M,3,High School,Married,$60K - $80K,Blue,39,5,1,3,12691.0,777,11914.0,1.335,1144,42,1.625,0.061
1,1,49,F,5,Graduate,Single,Less than $40K,Blue,44,6,1,2,8256.0,864,7392.0,1.541,1291,33,3.714,0.105
2,1,51,M,3,Graduate,Married,$80K - $120K,Blue,36,4,1,0,3418.0,0,3418.0,2.594,1887,20,2.333,0.000
3,1,40,F,4,High School,Unknown,Less than $40K,Blue,34,3,4,1,3313.0,2517,796.0,1.405,1171,20,2.333,0.760
4,1,40,M,3,Uneducated,Married,$60K - $80K,Blue,21,5,1,0,4716.0,0,4716.0,2.175,816,28,2.500,0.000

In [18]:
churn_df = pd.get_dummies(churn_df, columns=['Gender'])

churn_df.head()

,Attrition_Flag,Customer_Age,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,...,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio,Gender_F,Gender_M
0,1,45,3,High School,Married,$60K - $80K,Blue,39,5,1,...,12691.0,777,11914.0,1.335,1144,42,1.625,0.061,0,1
1,1,49,5,Graduate,Single,Less than $40K,Blue,44,6,1,...,8256.0,864,7392.0,1.541,1291,33,3.714,0.105,1,0
2,1,51,3,Graduate,Married,$80K - $120K,Blue,36,4,1,...,3418.0,0,3418.0,2.594,1887,20,2.333,0.000,0,1
3,1,40,4,High School,Unknown,Less than $40K,Blue,34,3,4,...,3313.0,2517,796.0,1.405,1171,20,2.333,0.760,1,0
4,1,40,3,Uneducated,Married,$60K - $80K,Blue,21,5,1,...,4716.0,0,4716.0,2.175,816,28,2.500,0.000,0,1

In [19]:
churn_df["Education_Level"].unique()

array(['High School', 'Graduate', 'Uneducated', 'Unknown', 'College',
       'Post-Graduate', 'Doctorate'], dtype=object)

In [20]:
education_level = (
    "Uneducated",
    "Unknown",
    "High School",
    "College",
    "Graduate",
    "Post-Graduate",
    "Doctorate"
)

In [21]:
education_level[0]

'Uneducated'

In [22]:
from sklearn.utils import column_or_1d

class MyLabelEncoder(LabelEncoder):

    def fit(self, y):
        y = column_or_1d(y, warn=True)
        self.classes_ = pd.Series(y).unique()
        return self

In [23]:
label_encoding_el = MyLabelEncoder()

label_encoding_el = label_encoding_el.fit(education_level)

In [24]:
churn_df['Education_Level'] = \
    label_encoding_el.transform(churn_df['Education_Level'].astype(str))

In [25]:
label_encoding_el.classes_

array(['Uneducated', 'Unknown', 'High School', 'College', 'Graduate',
       'Post-Graduate', 'Doctorate'], dtype=object)

In [26]:
churn_df.head()

,Attrition_Flag,Customer_Age,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,...,Credit_Limit,Total_Revolving_Bal,Avg_Open_To_Buy,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio,Gender_F,Gender_M
0,1,45,3,2,Married,$60K - $80K,Blue,39,5,1,...,12691.0,777,11914.0,1.335,1144,42,1.625,0.061,0,1
1,1,49,5,4,Single,Less than $40K,Blue,44,6,1,...,8256.0,864,7392.0,1.541,1291,33,3.714,0.105,1,0
2,1,51,3,4,Married,$80K - $120K,Blue,36,4,1,...,3418.0,0,3418.0,2.594,1887,20,2.333,0.000,0,1
3,1,40,4,2,Unknown,Less than $40K,Blue,34,3,4,...,3313.0,2517,796.0,1.405,1171,20,2.333,0.760,1,0
4,1,40,3,0,Married,$60K - $80K,Blue,21,5,1,...,4716.0,0,4716.0,2.175,816,28,2.500,0.000,0,1

In [27]:
churn_df["Marital_Status"].unique()

array(['Married', 'Single', 'Unknown', 'Divorced'], dtype=object)

In [30]:
churn_df["Income_Category"].unique()

array(['$60K - $80K', 'Less than $40K', '$80K - $120K', '$40K - $60K',
       '$120K +', 'Unknown'], dtype=object)

In [31]:
churn_df["Card_Category"].unique()

array(['Blue', 'Gold', 'Silver', 'Platinum'], dtype=object)

In [32]:
churn_df = pd.get_dummies(churn_df, columns=['Marital_Status'])

churn_df.head()

,Attrition_Flag,Customer_Age,Dependent_count,Education_Level,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,...,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio,Gender_F,Gender_M,Marital_Status_Divorced,Marital_Status_Married,Marital_Status_Single,Marital_Status_Unknown
0,1,45,3,2,$60K - $80K,Blue,39,5,1,3,...,1144,42,1.625,0.061,0,1,0,1,0,0
1,1,49,5,4,Less than $40K,Blue,44,6,1,2,...,1291,33,3.714,0.105,1,0,0,0,1,0
2,1,51,3,4,$80K - $120K,Blue,36,4,1,0,...,1887,20,2.333,0.000,0,1,0,1,0,0
3,1,40,4,2,Less than $40K,Blue,34,3,4,1,...,1171,20,2.333,0.760,1,0,0,0,0,1
4,1,40,3,0,$60K - $80K,Blue,21,5,1,0,...,816,28,2.500,0.000,0,1,0,1,0,0

In [34]:
income_category = (
    "Less than $40K",
    "Unknown",
    "$40K - $60K",
    "$60K - $80K",
    "$80K - $120K",
    "$120K +"
)

In [35]:
label_encoding_ic = MyLabelEncoder()

label_encoding_ic = label_encoding_ic.fit(income_category)

churn_df['Income_Category'] = \
    label_encoding_ic.transform(churn_df['Income_Category'].astype(str))

In [36]:
label_encoding_ic.classes_

array(['Less than $40K', 'Unknown', '$40K - $60K', '$60K - $80K',
       '$80K - $120K', '$120K +'], dtype=object)

In [37]:
churn_df.head()

,Attrition_Flag,Customer_Age,Dependent_count,Education_Level,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,...,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio,Gender_F,Gender_M,Marital_Status_Divorced,Marital_Status_Married,Marital_Status_Single,Marital_Status_Unknown
0,1,45,3,2,3,Blue,39,5,1,3,...,1144,42,1.625,0.061,0,1,0,1,0,0
1,1,49,5,4,0,Blue,44,6,1,2,...,1291,33,3.714,0.105,1,0,0,0,1,0
2,1,51,3,4,4,Blue,36,4,1,0,...,1887,20,2.333,0.000,0,1,0,1,0,0
3,1,40,4,2,0,Blue,34,3,4,1,...,1171,20,2.333,0.760,1,0,0,0,0,1
4,1,40,3,0,3,Blue,21,5,1,0,...,816,28,2.500,0.000,0,1,0,1,0,0

In [38]:
card_category = (
    "Blue",
    "Silver",
    "Gold",
    "Platinum"
)

In [39]:
label_encoding_cc = MyLabelEncoder()

label_encoding_cc = label_encoding_ic.fit(card_category)

churn_df['Card_Category'] = \
    label_encoding_cc.transform(churn_df['Card_Category'].astype(str))

In [40]:
label_encoding_ic.classes_

array(['Blue', 'Silver', 'Gold', 'Platinum'], dtype=object)

In [41]:
churn_df.sample(10)

,Attrition_Flag,Customer_Age,Dependent_count,Education_Level,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,...,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio,Gender_F,Gender_M,Marital_Status_Divorced,Marital_Status_Married,Marital_Status_Single,Marital_Status_Unknown
9856,0,44,4,0,3,1,37,1,2,2,...,8765,84,1.211,0.000,0,1,0,1,0,0
7615,1,41,2,1,0,0,34,6,3,3,...,4641,78,0.660,0.673,1,0,0,0,0,1
4695,1,53,0,0,5,0,47,5,2,1,...,4919,75,0.744,0.067,0,1,1,0,0,0
8411,1,26,0,0,1,1,13,1,2,3,...,4174,59,0.735,0.070,1,0,0,0,0,1
2540,1,56,2,2,3,0,51,5,6,3,...,1458,39,0.696,0.879,0,1,0,1,0,0
5623,1,51,2,6,0,0,40,3,3,3,...,4263,84,0.909,0.802,1,0,0,0,1,0
3339,1,38,3,4,0,0,34,5,3,2,...,3607,81,0.884,0.426,0,1,0,0,1,0
8661,0,48,4,5,0,0,38,3,3,3,...,4921,51,0.645,0.119,1,0,0,0,1,0
1395,1,37,4,4,0,0,31,5,2,3,...,2013,41,0.367,0.671,1,0,0,1,0,0
4908,1,44,3,2,1,0,31,5,6,4,...,3553,65,0.757,0.184,1,0,0,0,1,0

In [42]:
churn_df.dtypes

Attrition_Flag                int32
Customer_Age                  int64
Dependent_count               int64
Education_Level               int32
Income_Category               int32
Card_Category                 int32
Months_on_book                int64
Total_Relationship_Count      int64
Months_Inactive_12_mon        int64
Contacts_Count_12_mon         int64
Credit_Limit                float64
Total_Revolving_Bal           int64
Avg_Open_To_Buy             float64
Total_Amt_Chng_Q4_Q1        float64
Total_Trans_Amt               int64
Total_Trans_Ct                int64
Total_Ct_Chng_Q4_Q1         float64
Avg_Utilization_Ratio       float64
Gender_F                      uint8
Gender_M                      uint8
Marital_Status_Divorced       uint8
Marital_Status_Married        uint8
Marital_Status_Single         uint8
Marital_Status_Unknown        uint8
dtype: object